app/controllers/products_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "products" ("image_url", "title", "description", "link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create_by_user
    user = User.find(params[:user_id])
    product = user.products.new(product_params)
    if product.save

UPDATE "products" SET "image_url" = $1, "title" = $2, "description" = $3, "link" = $4, "updated_at" = $5 WHERE "products"."id" = $6
---
  def update
    if @product.update(product_params)